<a href="https://colab.research.google.com/github/sejallotliker/python_pandas/blob/main/Section_3_functions_of_pandas_and_numpy.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Section_3

Functions of pandas

Author:```Sejal Lotliker```

Date: ```03-06-2021```

In [1]:
import numpy as np
import pandas as pd

In [32]:
#Combination of Numpy as pandas
values_1= np.random.randint(10, size=10)
values_2= np.random.randint(10, size=10)
years= np.arange(2010,2020)
groups=['A','B','C','D','E','F','G','H','I','J']
df=pd.DataFrame({'group':groups,'year':years,'value_1':values_1,'value_2':values_2})

In [33]:
df

  group  year  value_1  value_2
0     A  2010        5        5
1     B  2011        7        1
2     C  2012        4        7
3     D  2013        1        9
4     E  2014        0        3
5     F  2015        3        6
6     G  2016        8        8
7     H  2017        1        9
8     I  2018        3        3
9     J  2019        1        4

Query function

In [9]:
df.query('value_1<value_2')

  group  year  value_1  value_2
3     D  2013        5        6
5     F  2015        7        9
9     J  2019        8        9

In [12]:
df.query('value_1>2')

  group  year  value_1  value_2
0     A  2010        6        2
1     B  2011        7        3
2     C  2012        5        3
3     D  2013        5        6
5     F  2015        7        9
6     G  2016        5        0
7     H  2017        7        1
8     I  2018        7        2
9     J  2019        8        9

In [34]:
new_col=np.random.randint(10)
#insert the column at the second position
df.insert(2,'my_new_col' , new_col)

In [35]:
df

  group  year  my_new_col  value_1  value_2
0     A  2010           7        5        5
1     B  2011           7        7        1
2     C  2012           7        4        7
3     D  2013           7        1        9
4     E  2014           7        0        3
5     F  2015           7        3        6
6     G  2016           7        8        8
7     H  2017           7        1        9
8     I  2018           7        3        3
9     J  2019           7        1        4

Calculating cumulative sum

In [40]:
df['cumsum_2']=df[['value_2','group']].groupby('group').cumsum()

In [42]:
df

  group  year  my_new_col  value_1  value_2  cumsum_2
0     A  2010           7        5        5         5
1     B  2011           7        7        1         1
2     C  2012           7        4        7         7
3     D  2013           7        1        9         9
4     E  2014           7        0        3         3
5     F  2015           7        3        6         6
6     G  2016           7        8        8         8
7     H  2017           7        1        9         9
8     I  2018           7        3        3         3
9     J  2019           7        1        4         4

#Sample function

used when we want to select a random sample from a distribution

In [43]:
sample_1=df.sample(n=3)
sample_1

  group  year  my_new_col  value_1  value_2  cumsum_2
9     J  2019           7        1        4         4
6     G  2016           7        8        8         8
0     A  2010           7        5        5         5

In [45]:
sample_2=df.sample(frac=0.5) # 0.5 will return half rows
sample_2

  group  year  my_new_col  value_1  value_2  cumsum_2
9     J  2019           7        1        4         4
4     E  2014           7        0        3         3
3     D  2013           7        1        9         9
1     B  2011           7        7        1         1
7     H  2017           7        1        9         9

#isin loc iloc and rank functions in pandas

In [47]:
#isin
years=['2014','2019','2013']
df[df.year.isin(years)]

  group  year  my_new_col  value_1  value_2  cumsum_2
3     D  2013           7        1        9         9
4     E  2014           7        0        3         3
9     J  2019           7        1        4         4

In [53]:
#loc = select by lables
df.loc[:4,['group','year']]

  group  year
0     A  2010
1     B  2011
2     C  2012
3     D  2013
4     E  2014

In [58]:
df.loc[[2,4,6],["year","value_1","value_2"]]

   year  value_1  value_2
2  2012        4        7
4  2014        0        3
6  2016        8        8

In [54]:
#iloc = select by position
df.iloc[:3,:4]

  group  year  my_new_col  value_1
0     A  2010           7        5
1     B  2011           7        7
2     C  2012           7        4

In [56]:
#pct_change = used to calculate percent change
df.value_2.pct_change()

0         NaN
1   -0.800000
2    6.000000
3    0.285714
4   -0.666667
5    1.000000
6    0.333333
7    0.125000
8   -0.666667
9    0.333333
Name: value_2, dtype: float64

In [57]:
#rank function= used to assign ranks to the values
df['rank']=df['value_1'].rank()
df

  group  year  my_new_col  value_1  value_2  cumsum_2  rank
0     A  2010           7        5        5         5   8.0
1     B  2011           7        7        1         1   9.0
2     C  2012           7        4        7         7   7.0
3     D  2013           7        1        9         9   3.0
4     E  2014           7        0        3         3   1.0
5     F  2015           7        3        6         6   5.5
6     G  2016           7        8        8         8  10.0
7     H  2017           7        1        9         9   3.0
8     I  2018           7        3        3         3   5.5
9     J  2019           7        1        4         4   3.0